Web@cademie/Second_Year/Bugs_Quest/app/controllers/etapes_controller.rb

SELECT "etapes".* FROM "etapes" WHERE "etapes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @etape = Etape.find(params[:id])

SELECT "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "pnjs".* FROM "pnjs"
---
    def new
        @etape = Etape.new(quest_id: params[:quest_id])
        @quest = Quest.find(params[:quest_id])
        @pnjs = Pnj.all

SELECT "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "pnjs".* FROM "pnjs"
INSERT INTO "etapes" ("numero", "question", "choix", "reponse", "quest_id", "pnj_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @etape = Etape.new(etape_params)
        @quest = Quest.find(params[:quest_id])
        @pnjs = Pnj.all

      if @etape.save

SELECT "etapes".* FROM "etapes" WHERE "etapes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "etapes" WHERE "etapes"."id" = ?  [["id", 2]]
---
    def destroy
        @etape = Etape.find(params[:id])
        @etape.destroy