Web@cademie/Second_Year/Bugs_Quest/app/controllers/joueurs_controller.rb

    def index
        @joueurs = Joueur.all
---
SELECT "joueurs".* FROM "joueurs"

    def show
        @joueur = Joueur.find(params[:id])
---
SELECT "joueurs".* FROM "joueurs" WHERE "joueurs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @joueur = Joueur.new(create_joueur_params)

        if @joueur.save
---
INSERT INTO "joueurs" ("name", "niveau", "force", "vie", "xp", "mort", "points", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def edit
        @joueur = Joueur.find(params[:id])
---
SELECT "joueurs".* FROM "joueurs" WHERE "joueurs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @joueur = Joueur.find(params[:id])
        somme_carac_avant = @joueur.vie + @joueur.force
        somme_point_avant = @joueur.vie + @joueur.force + @joueur.points
        @joueur.vie = update_joueur_params[:vie]
        @joueur.force = update_joueur_params[:force]

        somme_carac_apres = @joueur.vie + @joueur.force
        @joueur.points = somme_point_avant - somme_carac_apres

        somme_point_apres = @joueur.vie + @joueur.force + @joueur.points
        if somme_carac_avant < somme_carac_apres && somme_point_avant == somme_point_apres && @joueur.points >= 0
            @joueur.save
---
SELECT "joueurs".* FROM "joueurs" WHERE "joueurs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "joueurs" SET "force" = ?, "vie" = ?, "points" = ?, "updated_at" = ? WHERE "joueurs"."id" = ?  [["force", 15], ["vie", 13], ["points", 2], ["updated_at", "2023-06-05 08:21:29.529793"], ["id", 5]]

    def destroy
        @joueur = Joueur.find(params[:id])
        @joueur.destroy
---
SELECT "joueurs".* FROM "joueurs" WHERE "joueurs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "joueurs" WHERE "joueurs"."id" = ?  [["id", 3]]

    def start_quest
        @joueur = Joueur.find(params[:id])
        @pnj = Pnj.first
---
SELECT "joueurs".* FROM "joueurs" WHERE "joueurs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "pnjs".* FROM "pnjs" ORDER BY "pnjs"."id" ASC LIMIT ?  [["LIMIT", 1]]