Web@cademie/Second_Year/Bugs_Quest/app/controllers/objets_controller.rb

SELECT "objets".* FROM "objets"
---
    def index
      @objets = Objet.all

SELECT "objets".* FROM "objets" WHERE "objets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @objet = Objet.find(params[:id])

INSERT INTO "objets" ("name", "avatar", "type", "force", "vie", "xp", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["name", "Le fendoir"], ["avatar", "Arme"], ["type", nil], ["force", 10], ["vie", 6], ["xp", 4], ["created_at", "2023-06-03 07:14:40.506242"], ["updated_at", "2023-06-03 07:14:40.506242"]]
---
    def create
      @objet = Objet.new(objet_params)

      if @objet.save

SELECT "objets".* FROM "objets" WHERE "objets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
      @objet = Objet.find(params[:id])

SELECT "objets".* FROM "objets" WHERE "objets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "objets" SET "force" = ?, "updated_at" = ? WHERE "objets"."id" = ?  [["force", 768768], ["updated_at", "2023-06-03 07:28:11.942784"], ["id", 1]]
---
    def update
      @objet = Objet.find(params[:id])

      if @objet.update(objet_params)

SELECT "objets".* FROM "objets" WHERE "objets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "objets" WHERE "objets"."id" = ?  [["id", 1]]
---
    def destroy
      @objet = Objet.find(params[:id])
      @objet.destroy