Web@cademie/Second_Year/Bugs_Quest/app/controllers/pnjs_controller.rb

    def index
      @pnjs = Pnj.all
---
SELECT "pnjs".* FROM "pnjs"

    def show
      @pnj = Pnj.find(params[:id])
---
SELECT "pnjs".* FROM "pnjs" WHERE "pnjs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
      @pnj = Pnj.new(pnj_params)

      if @pnj.save
---
INSERT INTO "pnjs" ("name", "avatar", "vie", "force", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Bob"], ["avatar", ""], ["vie", 3], ["force", 3], ["created_at", "2023-06-02 21:58:29.657047"], ["updated_at", "2023-06-02 21:58:29.657047"]]

    def edit
      @pnj = Pnj.find(params[:id])
---
SELECT "pnjs".* FROM "pnjs" WHERE "pnjs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def update
      @pnj = Pnj.find(params[:id])

      if @pnj.update(pnj_params)
---
SELECT "pnjs".* FROM "pnjs" WHERE "pnjs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pnjs" SET "name" = ?, "vie" = ?, "force" = ?, "updated_at" = ? WHERE "pnjs"."id" = ?  [["name", "Bob Lenald"], ["vie", 5], ["force", 5], ["updated_at", "2023-06-03 21:48:32.027399"], ["id", 1]]

    def destroy
      @pnj = Pnj.find(params[:id])
      @pnj.destroy
---
SELECT "pnjs".* FROM "pnjs" WHERE "pnjs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "pnjs" WHERE "pnjs"."id" = ?  [["id", 1]]