Web@cademie/Second_Year/Bugs_Quest/app/controllers/quests_controller.rb

SELECT "quests".* FROM "quests"
---
    def index
      @quests = Quest.all

SELECT "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "etapes".* FROM "etapes" WHERE "etapes"."quest_id" = ?  [["quest_id", 4]]
---
    def show
      @quest = Quest.find(params[:id])
      @etapes = Etape.where(quest_id: params[:id])

INSERT INTO "quests" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "La boulangerie"], ["created_at", "2023-06-04 16:04:34.286208"], ["updated_at", "2023-06-04 16:04:34.286208"]]
---
    def create
      @quest = Quest.new(quest_params)

      if @quest.save

SELECT "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
      @quest = Quest.find(params[:id])

SELECT "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "quests" SET "name" = ?, "updated_at" = ? WHERE "quests"."id" = ?  [["name", "les dentiers"], ["updated_at", "2023-06-03 13:05:34.748351"], ["id", 3]]
---
    def update
      @quest = Quest.find(params[:id])

      if @quest.update(quest_params)

SELECT "quests".* FROM "quests" WHERE "quests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "quests" WHERE "quests"."id" = ?  [["id", 1]]
---
    def destroy
      @quest = Quest.find(params[:id])
      @quest.destroy